# Pandas: Data Cleaning

In [12]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Datadataset 
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [13]:
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [14]:
df['salary_year_avg'].median()

115000.0

In [15]:
df['salary_hour_avg'].median()

45.97999954223633

In [16]:
median_salary_year = df['salary_year_avg'].median()

median_salary_hour = df['salary_hour_avg'].median()

In [17]:
df_filled = df

df_filled['salary_year_avg'].fillna(median_salary_year)

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [18]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg'] # the df_filled table didnt change because we didn't set it to be equal to itself

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [19]:
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)

df_filled['salary_hour_avg'] = df_filled['salary_year_avg'].fillna(median_salary_hour)

In [20]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg'] #Now it shows up, because it is now saved to itself

    salary_year_avg  salary_hour_avg
0          115000.0         115000.0
1          115000.0         115000.0
2          115000.0         115000.0
3          115000.0         115000.0
4          115000.0         115000.0
5          115000.0         115000.0
6          115000.0         115000.0
7          115000.0         115000.0
8          115000.0         115000.0
9          115000.0         115000.0
10         115000.0         115000.0

In [ ]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates() #to save it to itself

In [24]:
print('Length of original df:', len(df_filled))
print('Length of drop duplicates df:', len(df_unique))
print('Rows dropped:', len(df_filled)-len(df_unique))

Length of original df: 785741
Length of drop duplicates df: 785640
Rows dropped: 101

In [26]:
df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

print('Length of original df:', len(df_filled))
print('Length of drop duplicates df:', len(df_unique))
print('Rows dropped:', len(df_filled)-len(df_unique))

Length of original df: 785741
Length of drop duplicates df: 508042
Rows dropped: 277699